In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import jdatetime

In [2]:
df_train = pd.read_csv("data/train_data.csv")
df_train.head()

,Invoice,Description,Quantity,UnitPrice,Customer ID,Country,StockCode,InvoiceDate
0,21387,TRAVEL CARD WALLET VINTAGE ROSE,24,0.42,1488,United Kingdom,2178,1401-11-27 14:46:24
1,8857,FAWN AND MUSHROOM GREETING CARD,12,0.42,6420,United Kingdom,3449,1401-03-30 13:56:24
2,7936,MONEY BOX POCKET MONEY DESIGN,1,1.25,10992,United Kingdom,1599,1401-03-12 14:10:24
3,4659,JUMBO BAG OWLS,10,1.95,4670,United Kingdom,240,1401-01-03 09:38:24
4,35812,SPACEBOY LUNCH BOX,2,1.95,11600,United Kingdom,1813,1402-09-06 09:12:24